{
  "heading": "Terms of Service",
  "updated": "2025-11-05",
  "isDraft": true,
  "body": "**Last Updated:** November 5, 2025\n\n## Agreement to Terms\n\nBy accessing or using the Imajin website and services, you agree to be bound by these Terms of Service. If you do not agree to these terms, please do not use our services.\n\n## Company Information\n\n**Imajin**  \nEmail: info@imajin.ca  \nWebsite: www.imajin.ca\n\n## Use of Services\n\n### Eligibility\n\nYou must be at least 18 years old to make purchases through our website. By placing an order, you represent that you are of legal age to form a binding contract.\n\n### Account Responsibilities\n\nIf you create an account, you are responsible for:\n- Maintaining the confidentiality of your account credentials\n- All activities that occur under your account\n- Notifying us immediately of any unauthorized use\n\n## Products and Orders\n\n### Product Information\n\nWe strive to provide accurate product descriptions, specifications, and pricing. However:\n- Product colors may vary slightly from photos\n- Specifications are subject to change without notice\n- We reserve the right to correct pricing errors\n\n### Orders and Payment\n\n- All orders are subject to acceptance and availability\n- Payment is processed through Stripe\n- Prices are in USD unless otherwise stated\n- We reserve the right to refuse or cancel any order\n\n### Pre-Orders\n\n- Pre-order items will ship on or around the estimated date provided\n- Pre-orders can be cancelled before shipping\n- Payment is processed at time of pre-order placement\n\n## Shipping and Delivery\n\nShipping terms:\n- Risk of loss passes to you upon delivery to the carrier\n- Delivery times are estimates and not guaranteed\n- International shipments may be subject to customs duties\n\nSee our [Shipping Policy](/shipping) for detailed information.\n\n## Returns and Refunds\n\nOur return policy:\n- 30-day return window for most products\n- Products must be unused and in original packaging\n- Return shipping costs are the responsibility of the customer unless the item is defective\n\nSee our [Returns Policy](/returns) for complete details.\n\n## Warranties\n\n### Founder Edition\n- 10-year limited warranty\n- Covers manufacturing defects and component failures\n- Does not cover damage from misuse or improper installation\n\n### Standard Products\n- 2-year limited warranty\n- Same coverage as Founder Edition\n\nSee our [Warranty Policy](/warranty) for full terms.\n\n## Intellectual Property\n\nAll content on this website, including:\n- Product designs\n- Photographs\n- Text and graphics\n- Software and code\n- Logos and trademarks\n\nare the property of Imajin and protected by copyright and trademark laws.\n\n## Limitation of Liability\n\nTo the maximum extent permitted by law:\n\n- Imajin is not liable for indirect, incidental, or consequential damages\n- Our total liability shall not exceed the amount paid for the product\n- We do not guarantee uninterrupted or error-free website operation\n\n## Indemnification\n\nYou agree to indemnify and hold harmless Imajin from any claims arising from:\n- Your use of our products or services\n- Your violation of these Terms\n- Your violation of any third-party rights\n\n## Modifications to Terms\n\nWe reserve the right to modify these Terms at any time. Changes will be effective immediately upon posting. Your continued use of our services constitutes acceptance of the modified Terms.\n\n## Governing Law\n\nThese Terms are governed by the laws of Canada. Any disputes shall be resolved in the courts of Canada.\n\n## Contact Information\n\nFor questions about these Terms of Service:\n\nEmail: info@imajin.ca  \n[Contact Page](/contact)\n\n---\n\n**Note:** These Terms of Service are subject to final legal review before launch."
}
